{
    "users": [
        {
            "id": 1,
            "username": "alejandrogomezai",
            "password": "eminem92AA!!"
        },
        {
            "id": 2,
            "username": "usuario2",
            "password": "contraseña2"
        }
    ],
    "conversations": [
        {
            "id": 1,
            "user_input": "Hola, tengo una pregunta sobre Python",
            "chatbot_response": "¡Por supuesto! Estoy aquí para ayudarte. ¿Cuál es tu pregunta sobre Python?"
        },
        {
            "id": 2,
            "user_input": "¿Cómo instalo bibliotecas en Python?",
            "chatbot_response": "Puedes instalar bibliotecas en Python usando el comando pip. Por ejemplo, para instalar la biblioteca requests, ejecutarías `pip install requests` en tu terminal."
        },
        {
            "user_input": "hola?",
            "chatbot_response": "¡Hola! ¿En qué puedo ayudarte hoy?"
        },
        {
            "user_input": "dame un código en python",
            "chatbot_response": "Por supuesto, aquí tienes un ejemplo de código en Python:<p><pre><code>python\n# Calculadora simple<p>def suma(a, b):\n    return a + b<p>def resta(a, b):\n    return a - b<p>def multiplicacion(a, b):\n    return a * b<p>def division(a, b):\n    if b != 0:\n        return a / b\n    else:\n        return \"Error: división entre cero no permitida\"<p># Ejemplo de uso de la calculadora\nnum1 = float(input(\"Ingrese el primer número: \"))\nnum2 = float(input(\"Ingrese el segundo número: \"))<p>print(\"Suma:\", suma(num1, num2))\nprint(\"Resta:\", resta(num1, num2))\nprint(\"Multiplicación:\", multiplicacion(num1, num2))\nprint(\"División:\", division(num1, num2))\n</code></pre><p>Este código es una calculadora simple en Python que permite realizar operaciones básicas como suma, resta, multiplicación y división. Simplemente ingresa los dos números y el programa mostrará los resultados de las operaciones."
        },
        {
            "user_input": "quien soy",
            "chatbot_response": "No tengo información personal tuya, así que no puedo saber quién eres. Soy solo un asistente virtual aquí para ayudarte con cualquier pregunta o tarea que tengas. ¿En qué puedo ayudarte hoy?"
        },
        {
            "user_input": "hola que tal?",
            "chatbot_response": "¡Hola! ¿Cómo puedo ayudarte con tu problema de codificación hoy?"
        },
        {
            "user_input": "tengo hambre",
            "chatbot_response": "¡Hola! Entiendo que tengas hambre, pero estoy aquí para ayudarte con un problema de codificación. ¿En qué puedo ayudarte?"
        },
        {
            "user_input": "en que se distingue python de javascript",
            "chatbot_response": "Python y JavaScript son dos lenguajes de programación ampliamente utilizados, pero tienen algunas diferencias clave:<p>1. Sintaxis: La sintaxis de Python se caracteriza por su legibilidad y su enfoque en la escritura clara y concisa del código. Por otro lado, la sintaxis de JavaScript puede ser más flexible y puede requerir el uso de puntos y comas para terminar las declaraciones.<p>2. Tipado: Python es un lenguaje de programación de tipado dinámico, lo que significa que las variables no tienen un tipo de dato definido y pueden cambiar durante la ejecución del programa. JavaScript, por otro lado, es un lenguaje de tipado dinámico que permite la manipulación flexible de tipos de datos.<p>3. Uso: Python es ampliamente utilizado en campos como la ciencia de datos, el aprendizaje automático y el desarrollo web, gracias a su amplia biblioteca de módulos y su facilidad de uso. JavaScript es ampliamente utilizado para el desarrollo web del lado del cliente y del lado del servidor, y también se utiliza para crear aplicaciones de escritorio y móviles.<p>4. Enfoque: Python es conocido por su facilidad de uso y su énfasis en la legibilidad del código. Está diseñado para fomentar una programación más estructurada y modular. Por otro lado, JavaScript es un lenguaje más flexible y puede ser utilizado para una variedad de enfoques de programación, como programación orientada a objetos o programación funcional.<p>En resumen, Python se enfoca en la simplicidad y la legibilidad, mientras que JavaScript es más flexible y se utiliza ampliamente para el desarrollo web. Ambos lenguajes tienen sus fortalezas y debilidades, y la elección entre ellos generalmente se basa en el proyecto o tarea específica que se está desarrollando."
        },
        {
            "user_input": "dame el código html de una web",
            "chatbot_response": "Aquí tienes un ejemplo básico de un código HTML para crear una página web:<p><pre><code>html\n<!DOCTYPE html>\n<html>\n<head>\n    <title>Título de la página</title>\n</head>\n<body>\n    <header>\n        <h1>Título principal</h1>\n    </header><p>    <nav>\n        <ul>\n            <li><a href=\"#\">Enlace 1</a></li>\n            <li><a href=\"#\">Enlace 2</a></li>\n            <li><a href=\"#\">Enlace 3</a></li>\n        </ul>\n    </nav><p>    <section>\n        <h2>Sección 1</h2>\n        <p>Contenido de la sección 1.</p>\n    </section><p>    <section>\n        <h2>Sección 2</h2>\n        <p>Contenido de la sección 2.</p>\n    </section><p>    <footer>\n        <p>Pie de página</p>\n    </footer>\n</body>\n</html>\n</code></pre><p>Eso es solo un código de ejemplo y puedes personalizarlo según tus necesidades. Recuerda que la estructura básica de un documento HTML consta de las etiquetas `<html>`, `<head>` y `<body>`. Dentro de `<head>` puedes agregar metadatos y enlaces a archivos CSS o JavaScript. En el `<body>` se encuentra el contenido visible de la página, que se organiza en diferentes elementos como encabezados, secciones, enlaces, etc.<p>Ten en cuenta que este código solo es una plantilla básica, y hay muchas posibilidades y elementos adicionales que puedes agregar a una página web según tus necesidades."
        },
        {
            "user_input": "hola que tal",
            "chatbot_response": "Hola, ¿cómo puedo ayudarte hoy?"
        },
        {
            "user_input": "hola que tal?",
            "chatbot_response": "Hola, ¡bienvenido! ¿En qué puedo ayudarte hoy?"
        }
    ]
}